mdhardenburgh/Blinky/Packages/.cache/Keil.STM32H7xx_DFP.2.3.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32H7xx_DFP</name>
  <description>STMicroelectronics STM32H7 Series Device Support and Examples</description>
  <url>https://www.keil.com/pack/</url>

  <releases>
    <release version="2.3.0" date="2019-06-14">
      Updated Pack to STM32Cube_FW_H7 Firmware Package version V1.4.0.
      Requires STM32CubeMX version 5.2.1.
      STM32CubeMX Integration:
      - Only supported for single core devices.
      - Updated MX_Device_h.ftl:
         -- Added parsing of USART virtual mode.
         -- Added handling for bracket symbols '(' and ')' in macro generation.
      Updated Board Examples for  STM32H743I_EVAL:
      - Updated to MDK-Middleware V7.8.0.
      - Updated to using CMSIS-RTOS2 RTX(Debug/Release).
      - Updated to enabling the Event Recorder in debug targets.
      CMSIS-Driver:
      - CAN: Corrected CAN SRAM read/write to 4 byte accesses.
      - ETH: Updated __MEMORY_AT macro supporting AC6.
      - FDCAN: Updated __MEMORY_AT macro  supporting AC6.
      - MCI: Updated to HAL drivers version 1.5.0.
      - USART: Updated Get Count functionality.
      - USB Host: Enable VDD33USB voltage level detector if internal FS transceiver is used.
      - USB Device
      -- Updated to HAL drivers version 1.5.0.
      -- Updated USBD_EndpointConfigure function to check that maximum packet size requested fits into configured FIFO (compile time configured).
      - SPI
      -- Corrected DCache Handling
      -- Removed __HAL_SPI_ENABLE from SPI_Control function
    </release>
    <release version="2.2.0" date="2018-09-04">
      Updated Pack to STM32Cube_FW_H7 Firmware Package version V1.3.0.
      - Updated HAL to version V1.3.0.
      Added device support for subfamily STM32H750.
      CMSIS Driver:
      - USB Device: Corrected transmitted count for non-control IN endpoints
    </release>
    <release version="2.1.0" date="2018-05-09">
      Updated Pack to STM32Cube_FW_H7 Firmware Package version V1.21.0.
      Reworked debug description and debug config files.
      Updated device documentation.
      CMSIS-Driver:
      - CAN:
      -- Changed FDCAN_ECR_TREC_.. to FDCAN_ECR_REC_.. to align with updated device header.
      -- Corrected SetBitrate function.
      - SPI: Corrected Slave select handling.
      - USART: Corrected UARTx/USARTx related typing mistakes.
      - I2C: master clock frequency generation corrected.
      Board Support:
      - STM32H743I_EVAL:
      -- Updated LCDConf.c for STM32H743I_EVAL.
      Board Examples:
      - Validated using STM32CubeMX version 4.25.0 and STM32Cube_FW_H7 version 1.2.0.
      - Updated Abstract.txt in examples reflecting Debug/Release targets.
      - Changed Compiler optimization level to "level 1" for Debug target in all examples.
      - Updated emWin examples to emWin V5.46e.
      - Added Event Recorder to the USB Device and Host examples.
      - Added SNMP_Agent Example.
      - Updated SMTP_Client example.
    </release>

    <release version="2.0.0" date="2017-10-02">
      This DFP requires STM32CubeMX V4.22.1 and STM32Cube_FW_H7 V1.1.0 or higher to be installed.
      New projects require the component 'Device:STM32Cube Framework:STM32CubeMX' for configuration of pins and clocks.
      Updated documentation for STM32Cube Framework usage.
      Added CMSIS-Driver:
      - CAN
      - ETH
      - I2C
      - MCI
      - SPI
      - UART/USART
      - USB Host / Device (no RTOS dependency)
      Added example projects for STM32H743I EVAL Board:
      - all projects have two targets 'debug' and 'release' and require CMSIS-RTOS2
      - Blinky
      - CAN
      - emWin
      - FileSystem
      - Network
      - USB
    </release>

    <release version="1.0.1" date="2017-08-03">
      fixed location specified in debugvars configfile attribute
    </release>

    <release version="1.0.0" date="2017-06-01">
      Initial release of STM32H7 Device Family Pack.
      Based on STM32Cube_FW_H7 Firmware Package version V1.0.0 (2017-04-30)
      Board Support for STM32H743I-EVAL Board:
      - CMSIS-RTOS2 Blinky
      - Fractal Demo
    </release>
  </releases>

  <keywords>                                                                  <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32H7</keyword>
    <keyword>STM32H7xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32H7 Series" Dvendor="STMicroelectronics:13">
      <!--book name="Documentation/?.pdf" title="STM32H7xx HAL Drivers"/-->

      <algorithm name="CMSIS/Flash/STM32H7xx_MT25TL01G.FLM"        start="0x90000000" size="0x04000000" RAMstart="0x20000000" RAMsize="0xFFF4" default="0" />
      <algorithm name="CMSIS/Flash/STM32H7xx_MT25TL01G_DUAL.FLM"   start="0x90000000" size="0x08000000" RAMstart="0x20000000" RAMsize="0xFFF4" default="0" />
      <algorithm name="CMSIS/Flash/MT25TL01G_STM32H750B-DISCO.FLM" start="0x90000000" size="0x08000000" RAMstart="0x20000000" RAMsize="0xFFF4" default="0" />	  
      <algorithm name="CMSIS/Flash/MT25TL01G_STM32H745I-DISCO.FLM" start="0x90000000" size="0x08000000" RAMstart="0x20000000" RAMsize="0xFFF4" default="0" />
      <algorithm name="CMSIS/Flash/STM32H743I-eval_FMC.FLM"        start="0x60000000" size="0x01000000" RAMstart="0x20000000" RAMsize="0xFFF4" default="0" />

      <description>
The STM32H7 series now includes dual-core microcontrollers with Arm Cortex-M7 and Cortex-M4 cores able to run up to 480 MHz and 240 MHz respectively.
Our single-core Cortex®-M7 STM32H7 series also benefits from this frequency increase and can now run up to 480 MHz as well.
Dual-core STM32H7 microcontrollers are available with an embedded SMPS for improved dynamic power efficiency.

