mdhardenburgh/Blinky/Packages/.cache/Keil.STM32H7xx_DFP.2.3.0.pdsc
        <sequences>
          <sequence name="DebugDeviceUnlock"  info="SingleCore DeviceUnlock">
            <block>
              __var value = 0;

              Sequence("CheckID");

              __ap   = 2;                                         // Switch to System Debug Access Port

              value  = Read32(0xE00E1004);                        // Read DBGMCU_CR
              value |= 0x00670000;                                // set preset values (enable all debug clocks by default)
                                                                  // DBGMCU_CR[18] CKDBGD3EN, [17] CKDBGD2EN, [16] CKDBGD1EN
                                                                  // DBGMCU_CR[22] D3DBGCKEN, [21] D1DBGCKEN
            </block>

            <control if="__traceout"> <!-- Enable Trace Clock and hence access to global trace components now -->
              <block>
                value |= 0x00100000;                              // DBGMCU_CR[20] TRACECLKEN
              </block>
            </control>

            <block>
              Write32(0xE00E1004, value);                         // Update DBGMCU_CR
            </block>

            <block info="DbgMCU registers">
              Write32(0xE00E1004 , DbgMCU_CR        | value);     // DBGMCU_CR:       Configure MCU Debug
              Write32(0xE00E1034 , DbgMCU_APB3_Fz1         );     // DBGMCU_APB3FZ1:  Configure APB3 peripheral freeze behavior
              Write32(0xE00E103C , DbgMCU_APB1L_Fz1        );     // DBGMCU_APB1LFZ1: Configure APB1L peripheral freeze behavior
              Write32(0xE00E104C , DbgMCU_APB2_Fz1         );     // DBGMCU_APB2FZ1:  Configure APB2 peripheral freeze behavior
              Write32(0xE00E1054 , DbgMCU_APB4_Fz1         );     // DBGMCU_APB4FZ1:  Configure APB4 peripheral freeze behavior
            </block>
          </sequence>
        </sequences>

        <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM"            start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />

        <memory    name="DTCMRAM"  access="rwx"  id="IRAM1"        start="0x20000000" size="0x00020000" default="1" init="0"/>
        <memory    name="RAM_D1"   access="rwx"  id="IRAM2"        start="0x24000000" size="0x00057000" default="1" init="0"/>
        <memory    name="RAM_D2"   access="rwx"                    start="0x30000000" size="0x00008000" default="1" init="0"/>
        <memory    name="RAM_D2S2" access="rwx"                    start="0x30020000" size="0x00004000" default="1" init="0"/>
        <memory    name="RAM_D3"   access="rwx"                    start="0x38000000" size="0x00010000" default="1" init="0"/>
     <!--memory    name="ITCMRAM"  access="rwx"                    start="0x00000000" size="0x00010000" default="1" init="0"/-->

        <!-- *************************  Device 'STM32H742AGIx'  ***************************** -->
        <device Dname="STM32H742AGIx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="169"/>
        </device>

        <!-- *************************  Device 'STM32H742AIIx'  ***************************** -->
        <device Dname="STM32H742AIIx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00200000" default="1" startup="1"/>

          <feature type="BGA" n="169"/>
        </device>

        <!-- *************************  Device 'STM32H742BGTx'  ***************************** -->
        <device Dname="STM32H742BGTx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="208"/>
        </device>

        <!-- *************************  Device 'STM32H742BITx'  ***************************** -->
        <device Dname="STM32H742BITx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00200000" default="1" startup="1"/>

          <feature type="QFP" n="208"/>
        </device>

        <!-- *************************  Device 'STM32H742IGKx'  ***************************** -->
        <device Dname="STM32H742IGKx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H742IIKx'  ***************************** -->
        <device Dname="STM32H742IIKx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00200000" default="1" startup="1"/>

          <feature type="BGA" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H742IGTx'  ***************************** -->
        <device Dname="STM32H742IGTx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H742IITx'  ***************************** -->
        <device Dname="STM32H742IITx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00200000" default="1" startup="1"/>

          <feature type="QFP" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H742VGHx'  ***************************** -->
        <device Dname="STM32H742VGHx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H742VIHx'  ***************************** -->
        <device Dname="STM32H742VIHx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00200000" default="1" startup="1"/>

          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H742VGTx'  ***************************** -->
        <device Dname="STM32H742VGTx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H742VITx'  ***************************** -->
        <device Dname="STM32H742VITx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00200000" default="1" startup="1"/>

          <feature type="QFP" n="100"/>
        </device>

