mdhardenburgh/Blinky/Packages/.cache/Keil.STM32H7xx_DFP.2.3.0.pdsc
        <!-- *************************  Device 'STM32H743IGTx'  ***************************** -->
        <device Dname="STM32H743IGTx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="169"/>
        </device>

        <!-- *************************  Device 'STM32H743IIKx'  ***************************** -->
        <device Dname="STM32H743IIKx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" id="IROM2" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H743IITx'  ***************************** -->
        <device Dname="STM32H743IITx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" id="IROM2" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H743VGHx'  ***************************** -->
        <device Dname="STM32H743VGHx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H743VGTx'  ***************************** -->
        <device Dname="STM32H743VGTx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H743VIHx'  ***************************** -->
        <device Dname="STM32H743VIHx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" id="IROM2" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H743VITx'  ***************************** -->
        <device Dname="STM32H743VITx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" id="IROM2" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H743XGHx'  ***************************** -->
        <device Dname="STM32H743XGHx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="240"/>
        </device>

        <!-- *************************  Device 'STM32H743XIHx'  ***************************** -->
        <device Dname="STM32H743XIHx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" id="IROM2" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="240"/>
        </device>

        <!-- *************************  Device 'STM32H743ZGTx'  ***************************** -->
        <device Dname="STM32H743ZGTx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="144"/>
        </device>

        <!-- *************************  Device 'STM32H743ZITx'  ***************************** -->
        <device Dname="STM32H743ZITx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" id="IROM2" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="144"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32H753'  **************************** -->
      <subFamily DsubFamily="STM32H753">
        <processor Dcore="Cortex-M7" DcoreVersion="r0p1" Dclock="480000000" Dmpu="MPU" Dfpu="DP_FPU" Dendian="Little-endian"/>
        <book name="Documentation/DUI0646B_cortex_m7_dgug.pdf" title="Cortex-M7 Generic User Guide"/>

        <debug svd="CMSIS/SVD/STM32H753x.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h7xx.h" define="STM32H753xx"/>
        <book name="Documentation/DM00314099.pdf" title="STM32H742, STM32H743/753 and STM32H750 Reference Manual"/>
        <book name="Documentation/DM00388325.pdf" title="STM32H753 Data Sheet"/>

        <debugvars configfile="CMSIS/Debug/STM32H742_743_753_750.dbgconf" version="1.1.0">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var DbgMCU_CR        = 0x00000007;   // DBGMCU_CR:       DBGMCU configuration register
                                                 //                  [ 8] DBGSTBY_D3, [ 7] DBGSTOP_D3
                                                 //                  [ 2] DBGSTBY_D1, [ 1] DBGSTOP_D1,  [ 0] DBGSLEEP_D1
          __var DbgMCU_APB3_Fz1  = 0x00000000;   // DBGMCU_APB3FZ1:  DBGMCU APB3 peripheral freeze register
          __var DbgMCU_APB1L_Fz1 = 0x00000000;   // DBGMCU_APB1LFZ1: DBGMCU APB1L peripheral freeze register
          __var DbgMCU_APB2_Fz1  = 0x00000000;   // DBGMCU_APB2FZ1:  DBGMCU APB2 peripheral freeze register
          __var DbgMCU_APB4_Fz1  = 0x00000000;   // DBGMCU_APB4FZ1:  DBGMCU APB4 peripheral freeze register

          __var TraceClk_Pin     = 0x00040002;   // PE2
          __var TraceD0_Pin      = 0x00040003;   // PE3
          __var TraceD1_Pin      = 0x00040004;   // PE4
          __var TraceD2_Pin      = 0x00040005;   // PE5
          __var TraceD3_Pin      = 0x00040006;   // PE6
        </debugvars>

