mdhardenburgh/Blinky/Packages/.cache/Keil.STM32H7xx_DFP.2.3.0.pdsc
        <sequences>
          <sequence name="DebugDeviceUnlock"  info="SingleCore DeviceUnlock">
            <block>
              __var value = 0;

              Sequence("CheckID");

              __ap   = 2;                                         // Switch to System Debug Access Port

              value  = Read32(0xE00E1004);                        // Read DBGMCU_CR
              value |= 0x00670000;                                // set preset values (enable all debug clocks by default)
                                                                  // DBGMCU_CR[18] CKDBGD3EN, [17] CKDBGD2EN, [16] CKDBGD1EN
                                                                  // DBGMCU_CR[22] D3DBGCKEN, [21] D1DBGCKEN
            </block>

            <control if="__traceout"> <!-- Enable Trace Clock and hence access to global trace components now -->
              <block>
                value |= 0x00100000;                              // DBGMCU_CR[20] TRACECLKEN
              </block>
            </control>

            <block>
              Write32(0xE00E1004, value);                         // Update DBGMCU_CR
            </block>

            <block info="DbgMCU registers">
              Write32(0xE00E1004 , DbgMCU_CR        | value);     // DBGMCU_CR:       Configure MCU Debug
              Write32(0xE00E1034 , DbgMCU_APB3_Fz1         );     // DBGMCU_APB3FZ1:  Configure APB3 peripheral freeze behavior
              Write32(0xE00E103C , DbgMCU_APB1L_Fz1        );     // DBGMCU_APB1LFZ1: Configure APB1L peripheral freeze behavior
              Write32(0xE00E104C , DbgMCU_APB2_Fz1         );     // DBGMCU_APB2FZ1:  Configure APB2 peripheral freeze behavior
              Write32(0xE00E1054 , DbgMCU_APB4_Fz1         );     // DBGMCU_APB4FZ1:  Configure APB4 peripheral freeze behavior
            </block>
          </sequence>
        </sequences>

        <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM"            start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />

        <memory    name="DTCMRAM"  access="rwx"  id="IRAM1"        start="0x20000000" size="0x00020000" default="1" init="0"/>
        <memory    name="RAM_D1"   access="rwx"  id="IRAM2"        start="0x24000000" size="0x00080000" default="1" init="0"/>
        <memory    name="RAM_D2"   access="rwx"                    start="0x30000000" size="0x00048000" default="1" init="0"/>
        <memory    name="RAM_D3"   access="rwx"                    start="0x38000000" size="0x00010000" default="1" init="0"/>
     <!--memory    name="ITCMRAM"  access="rwx"                    start="0x00000000" size="0x00010000" default="1" init="0"/-->

        <!-- *************************  Device 'STM32H753AIIx'  ***************************** -->
        <device Dname="STM32H753AIIx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" id="IROM2" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="169"/>
        </device>

        <!-- *************************  Device 'STM32H753BITx'  ***************************** -->
        <device Dname="STM32H753BITx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" id="IROM2" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="208"/>
        </device>

        <!-- *************************  Device 'STM32H753IIKx'  ***************************** -->
        <device Dname="STM32H753IIKx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" id="IROM2" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H753IITx'  ***************************** -->
        <device Dname="STM32H753IITx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" id="IROM2" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H753VIHx'  ***************************** -->
        <device Dname="STM32H753VIHx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" id="IROM2" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H753VITx'  ***************************** -->
        <device Dname="STM32H753VITx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" id="IROM2" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H753XIHx'  ***************************** -->
        <device Dname="STM32H753XIHx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" id="IROM2" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="240"/>
        </device>

        <!-- *************************  Device 'STM32H753ZITx'  ***************************** -->
        <device Dname="STM32H753ZITx">
          <memory name="FLASH_Bank1" access="rx" id="IROM1" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" id="IROM2" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="144"/>
        </device>

      </subFamily>

      <!-- ************************  Subfamily 'STM32H750' ROMLess  ******************** -->
      <subFamily DsubFamily="STM32H750">
        <processor Dcore="Cortex-M7" DcoreVersion="r0p1" Dclock="480000000" Dmpu="MPU" Dfpu="DP_FPU" Dendian="Little-endian"/>
        <book name="Documentation/DUI0646B_cortex_m7_dgug.pdf" title="Cortex-M7 Generic User Guide"/>

        <debug svd="CMSIS/SVD/STM32H750x.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h7xx.h" define="STM32H750xx"/>
        <book name="Documentation/DM00314099.pdf" title="STM32H742, STM32H743/753 and STM32H750 Reference Manual"/>
        <book name="Documentation/DM00496677.pdf" title="STM32H750VB STM32H750IB STM32H750XB Data Sheet"/>

        <debugvars configfile="CMSIS/Debug/STM32H742_743_753_750.dbgconf" version="1.1.0">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var DbgMCU_CR        = 0x00000007;   // DBGMCU_CR:       DBGMCU configuration register
                                                 //                  [ 8] DBGSTBY_D3, [ 7] DBGSTOP_D3
                                                 //                  [ 2] DBGSTBY_D1, [ 1] DBGSTOP_D1,  [ 0] DBGSLEEP_D1
          __var DbgMCU_APB3_Fz1  = 0x00000000;   // DBGMCU_APB3FZ1:  DBGMCU APB3 peripheral freeze register
          __var DbgMCU_APB1L_Fz1 = 0x00000000;   // DBGMCU_APB1LFZ1: DBGMCU APB1L peripheral freeze register
          __var DbgMCU_APB2_Fz1  = 0x00000000;   // DBGMCU_APB2FZ1:  DBGMCU APB2 peripheral freeze register
          __var DbgMCU_APB4_Fz1  = 0x00000000;   // DBGMCU_APB4FZ1:  DBGMCU APB4 peripheral freeze register

          __var TraceClk_Pin     = 0x00040002;   // PE2
          __var TraceD0_Pin      = 0x00040003;   // PE3
          __var TraceD1_Pin      = 0x00040004;   // PE4
          __var TraceD2_Pin      = 0x00040005;   // PE5
          __var TraceD3_Pin      = 0x00040006;   // PE6
        </debugvars>

