mdhardenburgh/Blinky/Packages/.cache/Keil.STM32H7xx_DFP.2.3.0.pdsc
    <condition id="CM7F_LE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7_LE_IAR">
      <description>Cortex-M7 processor based device in little endian mode for the IAR Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM7F_LE_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32H7">
      <description>STMicroelectronics STM32H7 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H7*"/>
    </condition>
    <condition id="STM32H742">
      <description>STMicroelectronics STM32H742 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H742*"/>
    </condition>
    <condition id="STM32H743">
      <description>STMicroelectronics STM32H743 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H743*"/>
    </condition>
    <condition id="STM32H745">
      <description>STMicroelectronics STM32H745 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H745*"/>
    </condition>
    <condition id="STM32H747">
      <description>STMicroelectronics STM32H747 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H747*"/>
    </condition>
    <condition id="STM32H750">
      <description>STMicroelectronics STM32H750 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H750*"/>
    </condition>
    <condition id="STM32H753">
      <description>STMicroelectronics STM32H753 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H753*"/>
    </condition>
    <condition id="STM32H755">
      <description>STMicroelectronics STM32H755 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H755*"/>
    </condition>
    <condition id="STM32H757">
      <description>STMicroelectronics STM32H757 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H757*"/>
    </condition>
    <condition id="STM32H7_SC">
      <description>STMicroelectronics STM32H7 Single Core Series devices</description>
      <accept condition="STM32H742"/>
      <accept condition="STM32H743"/>
      <accept condition="STM32H750"/>
      <accept condition="STM32H753"/>
    </condition>
    <condition id="STM32H7_DC">
      <description>STMicroelectronics STM32H7 Dual Core Series devices</description>
      <accept condition="STM32H745"/>
      <accept condition="STM32H747"/>
      <accept condition="STM32H755"/>
      <accept condition="STM32H757"/>
    </condition>

    <!-- Device + Compiler Conditions -->
    <condition id="STM32H742_ARMCC">
      <description>filter for STM32H742 devices and the ARM compiler</description>
      <require condition="STM32H742"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H743_ARMCC">
      <description>filter for STM32H743 devices and the ARM compiler</description>
      <require condition="STM32H743"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H745_ARMCC">
      <description>filter for STM32H745 devices and the ARM compiler</description>
      <require condition="STM32H745"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H747_ARMCC">
      <description>filter for STM32H747 devices and the ARM compiler</description>
      <require condition="STM32H747"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H750_ARMCC">
      <description>filter for STM32H750 devices and the ARM compiler</description>
      <require condition="STM32H750"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H753_ARMCC">
      <description>filter for STM32H753 devices and the ARM compiler</description>
      <require condition="STM32H753"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H755_ARMCC">
      <description>filter for STM32H755 devices and the ARM compiler</description>
      <require condition="STM32H755"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H757_ARMCC">
      <description>filter for STM32H757 devices and the ARM compiler</description>
      <require condition="STM32H757"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32H742_GCC">
      <description>filter for STM32H742 devices and the GCC compiler</description>
      <require condition="STM32H742"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H743_GCC">
      <description>filter for STM32H743 devices and the GCC compiler</description>
      <require condition="STM32H743"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H745_GCC">
      <description>filter for STM32H745 devices and the GCC compiler</description>
      <require condition="STM32H745"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H747_GCC">
      <description>filter for STM32H747 devices and the GCC compiler</description>
      <require condition="STM32H747"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H750_GCC">
      <description>filter for STM32H750 devices and the GCC compiler</description>
      <require condition="STM32H750"/>
      <require Tcompiler="GCC"/>
    </condition>
