mdhardenburgh/Blinky/Packages/.cache/Keil.STM32H7xx_DFP.2.3.0.pdsc
    <condition id="STM32H753_GCC">
      <description>filter for STM32H753 devices and the GCC compiler</description>
      <require condition="STM32H753"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H755_GCC">
      <description>filter for STM32H755 devices and the GCC compiler</description>
      <require condition="STM32H755"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H757_GCC">
      <description>filter for STM32H757 devices and the GCC compiler</description>
      <require condition="STM32H757"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="STM32H742_IAR">
      <description>filter for STM32H742 devices and the IAR compiler</description>
      <require condition="STM32H742"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32H743_IAR">
      <description>filter for STM32H743 devices and the IAR compiler</description>
      <require condition="STM32H743"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32H745_IAR">
      <description>filter for STM32H745 devices and the IAR compiler</description>
      <require condition="STM32H745"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32H747_IAR">
      <description>filter for STM32H747 devices and the IAR compiler</description>
      <require condition="STM32H747"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32H750_IAR">
      <description>filter for STM32H750 devices and the IAR compiler</description>
      <require condition="STM32H750"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32H753_IAR">
      <description>filter for STM32H753 devices and the IAR compiler</description>
      <require condition="STM32H753"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32H755_IAR">
      <description>filter for STM32H755 devices and the IAR compiler</description>
      <require condition="STM32H755"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32H757_IAR">
      <description>filter for STM32H757 devices and the IAR compiler</description>
      <require condition="STM32H757"/>
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32H7 CMSIS">
      <description>STMicroelectronics STM32H7 Device and CMSIS-CORE</description>
      <require condition="STM32H7"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>

    <!-- HAL Conditions -->
    <condition id="STM32H7 HAL">
      <description>STMicroelectronics STM32H7 Device and HAL</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32H7 HAL Common">
      <description>STMicroelectronics STM32H7 Device and HAL Common</description>
      <require condition="STM32H7_SC"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube Framework"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"/>
    </condition>
    <condition id="STM32H7 HAL Common DC">
      <description>STMicroelectronics STM32H7 Device and HAL Common Dual Core</description>
      <require condition="STM32H7_DC"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"/>
    </condition>
    <condition id="STM32H7 HAL GPIO">
      <description>STMicroelectronics STM32H7 Device and HAL with GPIO</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>
    <condition id="STM32H7 HAL DMA">
      <description>STMicroelectronics STM32H7 Device and HAL with DMA</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32H7 HAL DMA SPI">
      <description>STMicroelectronics STM32H7 Device and HAL with DMA, SPI</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SPI"/>
    </condition>
    <condition id="STM32H7 HAL DMA UART">
      <description>STMicroelectronics STM32H7 Device and HAL with DMA, UART</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="UART"/>
    </condition>
    <condition id="STM32H7 HAL MDMA">
      <description>STMicroelectronics STM32H7 Device and HAL with MDMA</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="MDMA"/>
    </condition>
    <condition id="STM32H7 HAL GPIO ADC">
      <description>STMicroelectronics STM32H7 Device and HAL with GPIO, ADC</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC"/>
    </condition>
    <condition id="STM32H7 HAL LTDC DMA2D Graphics LCD_RGB">
      <description>STMicroelectronics STM32H7 Device and HAL with LTDC and DMA2D and Graphics with LCD (RGB IF)</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"/>
      <require Cclass="Graphics"      Cgroup="CORE"/>
      <accept  Cclass="Board Support" Cgroup="emWin LCD" Cvariant="RGB IF"/>
    </condition>

    <!-- LL driver Conditions -->
    <condition id="STM32H7 LL">
      <description>STMicroelectronics STM32H7 Device and LL</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="Common"/>
    </condition>
