mdhardenburgh/Blinky/Packages/.cache/Keil.STM32H7xx_DFP.2.3.0.pdsc
    <condition id="STM32H7 LL Common">
      <description>STMicroelectronics STM32H7 Device and LL</description>
      <require condition="STM32H7"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube Framework"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="PWR"/>
    </condition>

    <!-- CMSIS Driver Conditions -->
    <condition id="STM32H7_SC CMSIS_Driver CAN">
      <description>Requirement for CMSIS CAN Driver</description>
      <require condition="STM32H7_SC"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
    </condition>
    <condition id="STM32H7_SC CMSIS_Driver ETH">
      <description>Requirement for CMSIS EMAC Driver</description>
      <require condition="STM32H7_SC"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="ETH"/>
    </condition>
    <condition id="STM32H7_SC CMSIS_Driver I2C">
      <description>Requirement for CMSIS I2C Driver</description>
      <require condition="STM32H7_SC"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"/>
    </condition>
    <condition id="STM32H7_SC CMSIS_Driver MCI">
      <description>Requirement for CMSIS MCI Driver</description>
      <require condition="STM32H7_SC"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>
    <condition id="STM32H7_SC CMSIS_Driver SPI">
      <description>Requirement for CMSIS SPI Driver</description>
      <require condition="STM32H7_SC"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SPI"/>
    </condition>
    <condition id="STM32H7_SC CMSIS_Driver USART">
      <description>Requirement for CMSIS USART Driver</description>
      <require condition="STM32H7_SC"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="USART"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="UART"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="IRDA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Smartcard"/>
    </condition>
    <condition id="STM32H7_SC CMSIS_Driver USBD">
      <description>Requirement for CMSIS USB Device Driver</description>
      <require condition="STM32H7_SC"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="PCD"/>
    </condition>
    <condition id="STM32H7_SC CMSIS_Driver USBH">
      <description>Requirement for CMSIS USB Host Driver</description>
      <require condition="STM32H7_SC"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
    </condition>

    <!-- STM32H743I-EVAL Board BSP Conditions -->
    <condition id="STM32H743I-EVAL LCD_RGB">
      <description>STMicroelectronics STM32H743I-EVAL LCD (RGB IF)</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Graphics Display" Cgroup="STM32H743I-EVAL" Cvariant="RGB IF"/>
    </condition>
    <condition id="STM32H743I-EVAL GLCD">
      <description>STMicroelectronics STM32H743I-EVAL GLCD</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="SDRAM"/>
    </condition>
    <condition id="STM32H743I-EVAL TS">
      <description>STMicroelectronics STM32H743I-EVAL TS</description>
      <require condition="STM32H7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Touch Screen"/>
    </condition>
    <condition id="STM32H743I-EVAL Joystick">
      <description>STMicroelectronics STM32H743I-EVAL Joystick</description>
      <require condition="STM32H7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP">
      <description>STMicroelectronics STM32746G-EVAL BSP</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="UART"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP Audio">
      <description>STMicroelectronics STM32H743I-EVAL BSP Audio</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SAI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2S"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="TIM"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP EEPROM">
      <description>STMicroelectronics STM32H743I-EVAL BSP EEPROM</description>
      <require condition="STM32H7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP IO">
      <description>STMicroelectronics STM32H743I-EVAL BSP IO</description>
      <require condition="STM32H7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP LCD">
      <description>STMicroelectronics STM32H743I-EVAL BSP LCD</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="SDRAM"/>
    </condition>
