mdhardenburgh/Blinky/Packages/.cache/Keil.STM32H7xx_DFP.2.3.0.pdsc
    <condition id="STM32H743I-EVAL BSP NOR">
      <description>STMicroelectronics STM32H743I-EVAL BSP NOR</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="NOR"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP QSPI">
      <description>STMicroelectronics STM32H743I-EVAL BSP QSPI</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="QSPI"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP SD">
      <description>STMicroelectronics STM32H743I-EVAL BSP SD</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SD"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP SDRAM">
      <description>STMicroelectronics STM32H743I-EVAL BSP SDRAM</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SDRAM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="MDMA"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP SRAM">
      <description>STMicroelectronics STM32H743I-EVAL BSP SRAM</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP TS">
      <description>STMicroelectronics STM32H743I-EVAL BSP TS</description>
      <require condition="STM32H7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>

  </conditions>

  <generators>
    <!-- This generator is launched if any component referencing this generator by 'id' is selected and the specified <gpdsc> file does not exist -->
    <generator id="STM32CubeMX">
      <description>ST Microelectronics: STCubeMX Environment</description>
      <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command> <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <workingDir>$PRTE/Device</workingDir> <!-- path is specified either absolute or relative to PDSC or GPDSC file. If not specified it is the project directory configured by the environment -->
      <arguments>
        <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>$D</argument>
        <!-- Project path and project name (as configured by environment) -->
        <argument>#P</argument>
        <!-- absolute or relative to workingDir. $S = Device Family Pack base folder -->
        <argument>$S</argument>
      </arguments>
      <!-- path is either absolute or relative to working directory -->
      <gpdsc name="$PRTE/Device/$D/FrameworkCubeMX.gpdsc"/>
    </generator>
  </generators>

  <taxonomy>
    <!--description Cclass="Device" Cgroup="STM32Cube HAL" doc="Documentation/DM00189702.pdf">STM32H7xx Hardware Abstraction Layer (HAL) Drivers</description-->
    <!--description Cclass="Graphics Display">Display Interface including configuration for emWIN</description-->
    <description Cclass="Board Support" Cgroup="Drivers">ST BSP Drivers</description>
  </taxonomy>

  <apis>
    <api Cclass="Device" Cgroup="STM32Cube Framework" exclusive="1" Capiversion="1.1.0">
      <description>STM32Cube Framework</description>
      <files>
        <file category="doc" name="MDK/CubeMX/Documentation/index.html"/>
      </files>
    </api>
  </apis>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.5.0" condition="STM32H7 CMSIS">
      <description>System Startup for STMicroelectronics STM32H7 Series</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STARTUP_STM32H7XX    /* Device Startup for STM32H7 */
      </RTE_Components_h>
      <files>
        <!--  include folder -->
        <file category="include" name="Drivers/CMSIS/Device/ST/STM32H7xx/Include/"/>

        <!-- Flash Option Bytes templates -->
        <!--file category="source" condition="STM32H7_ARMCC" name="MDK/Device/Source/ARM/STM32H7xx_OPT.s" attr="template" select="Flash Option Bytes"/-->
        <!--file category="source" condition="STM32H7_ARMCC" name="MDK/Device/Source/ARM/STM32H7xx_OTP.s" attr="template" select="Flash One-Time programmable Bytes"/-->

        <!-- common device header file -->
        <file category="header"  name="Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h7xx.h"/>

        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="source" condition="STM32H742_ARMCC" name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h742xx.s" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H743_ARMCC" name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h743xx.s" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H745_ARMCC" name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h745xx.s" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H747_ARMCC" name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h747xx.s" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H750_ARMCC" name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h750xx.s" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H753_ARMCC" name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h753xx.s" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H755_ARMCC" name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h755xx.s" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H757_ARMCC" name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h757xx.s" attr="config" version="1.5.0"/>

        <!-- GCC Toolchain -->
        <file category="source" condition="STM32H742_GCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h742xx.S" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H743_GCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h743xx.S" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H745_GCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h745xx.S" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H747_GCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h747xx.S" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H750_GCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h750xx.S" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H753_GCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h753xx.S" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H755_GCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h755xx.S" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H757_GCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h757xx.S" attr="config" version="1.5.0"/>

        <!-- IAR Toolchain -->
        <file category="source" condition="STM32H742_IAR"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h742xx.s" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H743_IAR"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h743xx.s" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H745_IAR"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h745xx.s" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H747_IAR"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h747xx.s" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H750_IAR"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h750xx.s" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H753_IAR"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h753xx.s" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H755_IAR"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h755xx.s" attr="config" version="1.5.0"/>
        <file category="source" condition="STM32H757_IAR"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h757xx.s" attr="config" version="1.5.0"/>

        <!-- system file -->
        <file category="source"                             name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/system_stm32h7xx.c"        attr="config" version="1.5.0"/>
      </files>
    </component>

