mdhardenburgh/Blinky/Packages/.cache/Keil.STM32H7xx_DFP.2.3.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"       Cversion="1.5.0" condition="STM32H7 HAL">
      <description>DMA controller (DMA) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DMA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_dma.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_dma_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"     Cversion="1.5.0" condition="STM32H7 HAL">
      <description>Chrom-Art Accelerator (DMA2D) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DMA2D
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_dma2d.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DSI"       Cversion="1.5.0" condition="STM32H7 HAL">
      <description>Display Serial Interface (DSI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DSI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_dsi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="ETH"       Cversion="1.5.0" condition="STM32H7 HAL">
      <description>Ethernet MAC (ETH) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_ETH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_eth.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_eth_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="FDCAN"     Cversion="1.5.0" condition="STM32H7 HAL">
      <description>Controller area network (FDCAN1) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FDCAN
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_fdcan.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Flash"     Cversion="1.5.0" condition="STM32H7 HAL">
      <description>Embedded Flash memory HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FLASH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_flash.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_flash_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"      Cversion="1.5.0" condition="STM32H7 HAL">
      <description>General-purpose I/O (GPIO) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_GPIO
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_gpio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="HASH"      Cversion="1.5.0" condition="STM32H7 HAL DMA">
      <description>Hash processor (HASH) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_HASH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_hash.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_hash_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="HCD"       Cversion="1.5.0" condition="STM32H7 HAL">
      <description>USB Host controller (HCD) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_HCD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_hcd.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_usb.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="HRTIM"     Cversion="1.5.0" condition="STM32H7 HAL DMA">
      <description>High Resolution Timer (HRTIM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_HRTIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_hrtim.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="HSEM"      Cversion="1.5.0" condition="STM32H7 HAL">
      <description>Hardware semaphore (HSEM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_HSEM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_hsem.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"       Cversion="1.5.0" condition="STM32H7 HAL DMA">
      <description>Inter-integrated circuit (I2C) interface HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_I2C
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_i2c.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_i2c_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2S"       Cversion="1.5.0" condition="STM32H7 HAL DMA SPI">
      <description>I2S HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_I2S
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_i2s.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_i2s_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="IRDA"      Cversion="1.5.0" condition="STM32H7 HAL DMA">
      <description>IrDA HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_IRDA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_irda.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="IWDG"      Cversion="1.5.0" condition="STM32H7 HAL">
      <description>Independent watchdog (IWDG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_IWDG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_iwdg.c"/>
      </files>
    </component>
