mdhardenburgh/Blinky/Packages/.cache/Keil.STM32H7xx_DFP.2.3.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="JPEG"      Cversion="1.5.0" condition="STM32H7 HAL MDMA">
      <description>JPEG encoder/decoder (JPEG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_JPEG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_jpeg.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="LPTIM"     Cversion="1.5.0" condition="STM32H7 HAL">
      <description>Low-power timer (LPTIM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LPTIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_lptim.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"      Cversion="1.5.0" condition="STM32H7 HAL">
      <description>LCD-TFT Controller (LTDC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LTDC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_ltdc.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_ltdc_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="MDIOS"     Cversion="1.5.0" condition="STM32H7 HAL">
      <description>Management Data IO (MDIOS) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MDIOS
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_mdios.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="MDMA"      Cversion="1.5.0" condition="STM32H7 HAL">
      <description>Master DMA (MDMA) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MDMA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_mdma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="MMC"       Cversion="1.5.0" condition="STM32H7 HAL DMA">
      <description>MMC card HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_MMC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_mmc.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_mmc_ex.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_sdmmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="NAND"      Cversion="1.5.0" condition="STM32H7 HAL">
      <description>NAND Flash controller HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_NAND
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_nand.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_fmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="NOR"       Cversion="1.5.0" condition="STM32H7 HAL">
      <description>NOR Flash controller HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_NOR
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_nor.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_fmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="OPAMP"     Cversion="1.5.0" condition="STM32H7 HAL">
      <description>Operational amplifier (OPAMP) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_OPAMP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_opamp.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_opamp_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="PCD"       Cversion="1.5.0" condition="STM32H7 HAL">
      <description>USB Peripheral controller (PCD) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PCD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_pcd.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_pcd_ex.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_usb.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"       Cversion="1.5.0" condition="STM32H7 HAL">
      <description>Power controller (PWR) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PWR
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_pwr.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_pwr_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="QSPI"      Cversion="1.5.0" condition="STM32H7 HAL MDMA">
      <description>Quad Serial peripheral interface (QSPI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_QSPI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_qspi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="RAMECC"    Cversion="1.5.0" condition="STM32H7 HAL">
      <description>RAM ECC monitoring (RAMECC) peripheral HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RAMECC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_ramecc.c"/>
      </files>
    </component>
