mdhardenburgh/Blinky/Packages/.cache/Keil.STM32H7xx_DFP.2.3.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="UART"      Cversion="1.5.0" condition="STM32H7 HAL DMA">
      <description>Universal asynchronous receiver transmitter (UART) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_UART
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_uart.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_uart_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="USART"     Cversion="1.5.0" condition="STM32H7 HAL DMA">
      <description>Universal synchronous asynchronous receiver transmitter (USART) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_USART
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_usart.c"/>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_usart_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="WWDG"      Cversion="1.5.0" condition="STM32H7 HAL">
      <description>Window watchdog (WWDG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_WWDG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_wwdg.c"/>
      </files>
    </component>

    <!-- END: STMicroelectronics STM32CubeH7 HAL -->

    <!-- START: STMicroelectronics STM32CubeH7 LL -->
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="Common"     Cversion="1.5.0" condition="STM32H7 LL Common">
      <description>Common LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_COMMON
      </RTE_Components_h>
      <files>
        <file category="include" name="Drivers/STM32H7xx_HAL_Driver/Inc/"/>
        <file category="include" name="Drivers/STM32H7xx_HAL_Driver/Inc/Legacy/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="ADC"        Cversion="1.5.0" condition="STM32H7 LL">
      <description>Analog-to-digital converter (ADC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_ADC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_adc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="BDMA"       Cversion="1.5.0" condition="STM32H7 LL">
      <description>Basic DMA controller (BDMA) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_BDMA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_bdma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="COMP"       Cversion="1.5.0" condition="STM32H7 LL">
      <description>Analog Comparator (CRC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_COMP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_comp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="CRC"        Cversion="1.5.0" condition="STM32H7 LL">
      <description>CRC calculation unit (CRC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_CRC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_crc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="DAC"        Cversion="1.5.0" condition="STM32H7 LL">
      <description>Digital-to-analog converter (DAC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_DAC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_dac.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="DELAY_BLOCK" Cversion="1.5.0" condition="STM32H7 LL">
      <description>Delay Block LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_DELAY_BLOCK
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_delayblock.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="DMA"        Cversion="1.5.0" condition="STM32H7 LL">
      <description>DMA controller (DMA) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_DMA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_dma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="DMA2D"      Cversion="1.5.0" condition="STM32H7 LL">
      <description>Chrom-Art Accelerator (DMA2D) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_DMA2D
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_dma2d.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="EXTI"       Cversion="1.5.0" condition="STM32H7 LL">
      <description>Extended interrupts and events controller (EXTI) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_EXTI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_exti.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="FMC"        Cversion="1.5.0" condition="STM32H7 LL">
      <description>Flexible memory controller (FMC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_FMC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_fmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="GPIO"       Cversion="1.5.0" condition="STM32H7 LL">
      <description>General-purpose I/O (GPIO) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_GPIO
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_gpio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="HRTIM"      Cversion="1.5.0" condition="STM32H7 LL">
      <description>High-Resolution Timer (HRTIM)LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_HRTIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_hrtim.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="I2C"        Cversion="1.5.0" condition="STM32H7 LL">
      <description>Inter-integrated circuit (I2C) interface LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_I2C
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_i2c.c"/>
      </files>
    </component>
