mdhardenburgh/Blinky/Packages/.cache/Keil.STM32H7xx_DFP.2.3.0.pdsc
      <component Cgroup="Drivers" Csub="Basic I/O"                            condition="STM32H743I-EVAL BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio"                                condition="STM32H743I-EVAL BSP Audio">
        <description>Audio for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/wm8994/wm8994.c"/>
          <file category="library" condition="CM7_LE_ARMCC"  name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_Keil_wc16.lib"/>
          <file category="library" condition="CM7F_LE_ARMCC" name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_Keil_wc16.lib"/>
          <file category="library" condition="CM7_LE_GCC"    name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_GCC_wc32.a"/>
          <file category="library" condition="CM7F_LE_GCC"   name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_GCC_wc32.a"/>
          <file category="library" condition="CM7_LE_IAR"    name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_IAR_wc32.a"/>
          <file category="library" condition="CM7F_LE_IAR"   name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_IAR_wc32.a"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="EEPROM"                               condition="STM32H743I-EVAL BSP EEPROM">
        <description>EERPOM for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_eeprom.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="I/O"                                  condition="STM32H743I-EVAL BSP IO">
        <description>I/O for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_io.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_io.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="LCD"                                  condition="STM32H743I-EVAL BSP LCD">
        <description>LCD for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_lcd.c"/>
          <file category="source" name="Drivers/BSP/Components/stmpe811/stmpe811.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="NOR"                                  condition="STM32H743I-EVAL BSP NOR">
        <description>NOR Flash for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_nor.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_nor.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="QSPI"                                 condition="STM32H743I-EVAL BSP QSPI">
        <description>QSPI Flash for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_qspi.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_qspi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SD"                                   condition="STM32H743I-EVAL BSP SD">
        <description>uSD for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_sd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SDRAM"                                condition="STM32H743I-EVAL BSP SDRAM">
        <description>SDRAM for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_sdram.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_sdram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SRAM"                                 condition="STM32H743I-EVAL BSP SRAM">
        <description>SRAM for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_sram.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_sram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Touch Screen"                         condition="STM32H743I-EVAL BSP TS">
        <description>Touch Screen for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I_EVAL/stm32h743i_eval_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/stmpe811/stmpe811.c"/>
          <file category="source" name="Drivers/BSP/Components/ts3510/ts3510.c"/>
          <file category="source" name="Drivers/BSP/Components/exc7200/exc7200.c"/>
        </files>
      </component>
      <component Cgroup="LED"           Capiversion="1.0.0"                   condition="STM32H7 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/LED_743I_EVAL.c"/>
        </files>
      </component>
